# -----------------------------------------------------------------------------
# Homebrew config to install macOS software using `brew bundle`
# -----------------------------------------------------------------------------

tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'ljcooke/commands'

brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'dos2unix'
brew 'fortune'
brew 'ghostscript'
brew 'git'
brew 'imagemagick'
brew 'man2html'
brew 'mas'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'

cask 'hex-fiend'
cask 'iterm2'
cask 'macvim'
cask 'sublime-text'
cask 'vlc'
