# -----------------------------------------------------------------------------
# Homebrew config to install macOS software using `brew bundle`
# -----------------------------------------------------------------------------

tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bats'
brew 'cdparanoia'
brew 'checkbashisms'
brew 'cloc'
brew 'coreutils'
brew 'direnv'
brew 'dos2unix'
brew 'exiftool'
brew 'eye-d3'
brew 'fortune'
brew 'ghostscript'
brew 'git'
brew 'git-annex'
brew 'imagemagick'
brew 'man2html'
brew 'python'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'ruby-build'
brew 'rustup-init'
brew 'shellcheck'
brew 'tarsnap'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'

cask 'hex-fiend'
cask 'iterm2'
cask 'macvim'
cask 'sublime-text'
cask 'vlc'
